[
  {
    "title": "Banana Design",
    "image": "./images/BananaDesign.png",
    "description": "Create a simple WordPress website to learn the basics of WordPress, including installation, theme customization, page creation, and plugin management. Ideal for beginners to understand core WordPress functionalities.",
    "link": "https://bananadesign.portfolio-sbrt.com/"
  },
  {
    "title": "Wish Project",
    "image": "./images/wish-project.png",
    "description": "The Wish Project is a course project to learn the basics of the Symfony framework: controller, entity, form, repository, adding, deleting, editing in the database",
    "link": "https://wish.portfolio-sbrt.com/"
  },
  {
    "title": "TwitThor",
    "image": "./images/twithor.png",
    "description": "The Twitter project is a course project developed using React. This project is designed to provide a experience with the fundamental concepts of the React framework. It covers various aspects such as components, props, and other core features of React. The aim is to provide a practical understanding of how these elements work together to build a dynamic web application.",
    "link": "https://youtu.be/iFYvu0avXg4"
  },
  {
    "title": "La Maison Jungle",
    "image": "./images//la-maison-jungle.png",
    "description": "A plant e-commerce site project designed for practicing React. Developed as part of an OpenClassrooms course, this project allows users to browse and purchase a variety of plants. Features include cart management, product detail displays, and a modern, responsive user interface.",
    "link": "https://paul-sbrt.github.io/La-Maison-Jungle/"
  },
  {
    "title": "FavFilm",
    "image": "./images/FavFilm.png",
    "description": "I created a website to learn React for school. The website allows users to explore a collection of films, displaying them and providing sorting options. It serves as a practical exercise in React development and user interface design.",
    "link": "https://paul-sbrt.github.io/React-FavFilm/"
  },
  {
    "title": "New Home Page",
    "image": "./images/newsHomePage.png",
    "description": "This project entails building a responsive news website homepage, focusing on HTML, CSS, and basic JavaScript skills. Participants are tasked with replicating the design as closely as possible, ensuring responsiveness across different screen sizes and incorporating hover and focus states for interactive elements.",
    "link": "https://paul-sbrt.github.io/News-Home-Page-/"
  },
  {
    "title": "Newsletter Sign Up",
    "image": "./images/newsletter sign up .png",
    "description": "I developed an interactive newsletter signup form from a given design. Users can input their email, receiving a confirmation message upon successful submission, along with responsive design for various screens.",
    "link": "https://paul-sbrt.github.io/newsletter-sign-up-/"
  },
  {
    "title": "Interactive Rating",
    "image": "./images/interactive rating.png",
    "description": "I created a responsive rating component with hover effects based on a design, encouraging user interaction. After rating, a 'Thank you' card boosts engagement.",
    "link": "https://paul-sbrt.github.io/Interactive-rating-/"
  },
  {
    "title": "Taxifood",
    "image": "./images/taxifood.png",
    "description": "Group project for training assessment (CEFIM). I designed the team page to showcase store members with photos and roles, enabling their information to be editable for administrative purposes.",
    "link": "https://paul-sbrt.github.io/TaxiFood/"
  },
  {
    "title": "SuperApp",
    "image": "./images/superapp.png",
    "description": "Successful integration of the 'Super App' landing page designed in Adobe XD. Demonstration of development skills and highlighting the attractive interface of the application.",
    "link": "https://paul-sbrt.github.io/Challenge/"
  },
  {
    "title": "Excursion Site",
    "image": "./images/excursion.jpg",
    "description": "Here are my first exercises as a beginner that I did to work on my HTML and CSS on Codecademy.",
    "link": "https://paul-sbrt.github.io/excursion/"
  },
  {
    "title": "Tea Cozy",
    "image": "./images/tea.jpg",
    "description": "Here are my first exercises as a beginner that I did to work on my HTML and CSS on Codecademy.",
    "link": "https://paul-sbrt.github.io/Projet-Tea-Cozy/"
  }
]
