[
  {
    "title": "FavFilm",
    "image": "./images/FavFilm.png",
    "description": "I created a website to learn React for school. The website allows users to explore a collection of films, displaying them and providing sorting options. It serves as a practical exercise in React development and user interface design.",
    "link": "https://paul-sbrt.github.io/React-FavFilm/"
  },
  {
    "title": "New Home Page",
    "image": "./images/newsHomePage.png",
    "description": "This project entails building a responsive news website homepage, focusing on HTML, CSS, and basic JavaScript skills. Participants are tasked with replicating the design as closely as possible, ensuring responsiveness across different screen sizes and incorporating hover and focus states for interactive elements.",
    "link": "https://paul-sbrt.github.io/News-Home-Page-/"
  },
  {
    "title": "Newsletter Sign Up",
    "image": "./images/newsletter sign up .png",
    "description": "I developed an interactive newsletter signup form from a given design. Users can input their email, receiving a confirmation message upon successful submission, along with responsive design for various screens.",
    "link": "https://paul-sbrt.github.io/newsletter-sign-up-/"
  },
  {
    "title": "Interactive Rating",
    "image": "./images/interactive rating.png",
    "description": "I created a responsive rating component with hover effects based on a design, encouraging user interaction. After rating, a 'Thank you' card boosts engagement.",
    "link": "https://paul-sbrt.github.io/Interactive-rating-/"
  },
  {
    "title": "Taxifood",
    "image": "./images/taxifood.png",
    "description": "Group project for training assessment (CEFIM). I designed the team page to showcase store members with photos and roles, enabling their information to be editable for administrative purposes.",
    "link": "https://paul-sbrt.github.io/TaxiFood/"
  },
  {
    "title": "SuperApp",
    "image": "./images/superapp.png",
    "description": "Successful integration of the 'Super App' landing page designed in Adobe XD. Demonstration of development skills and highlighting the attractive interface of the application.",
    "link": "https://paul-sbrt.github.io/Challenge/"
  },
  {
    "title": "Excursion Site",
    "image": "./images/excursion.jpg",
    "description": "Here are my first exercises as a beginner that I did to work on my HTML and CSS on Codecademy.",
    "link": "https://paul-sbrt.github.io/excursion/"
  },
  {
    "title": "Tea Cozy",
    "image": "./images/tea.jpg",
    "description": "Here are my first exercises as a beginner that I did to work on my HTML and CSS on Codecademy.",
    "link": "https://paul-sbrt.github.io/Projet-Tea-Cozy/"
  }
]
